import SliderRazvivalochka from '@/components/slider-razvivalochka';
import Link from 'next/link';

export default function Razvivalochkanhk() {
    return (
        <main className="md:container md:mx-auto pt-[85px]">
            <section className="py-5 lg:py-[30px] bg-grey-light m-0">
                <ol className="flex flex-wrap text-xs leading-4 text-green md:text-lg lg:text-xl lg:leading-5">
                    <li>
                        <Link className="opacity-[0.75]" href="/">
                            Главная
                        </Link>
                    </li>
                    <li>
                        <span className="opacity-[0.75] before:mx-3 before:inline-block before:content-['/']">
                            Развивалочкаnhk
                        </span>
                    </li>
                </ol>
            </section>
            <section className="flex flex-col gap-5 mt-5 lg:mt-[60px] px-8 text-xl">
                <h1 className="subtitle2">
                    Студия раннего развития &quot;Развивалочкаnhk&quot;
                </h1>

                <a
                    href="https://chat.whatsapp.com/Jg66wcl1RxPDRSH3tGGOaj"
                    className="text-2xl text-center border-brown underline"
                >
                    Вступить в группу WhatsApp
                </a>

                <p>
                    Расписание: ВТОРНИК И ЧЕТВЕРГ в 10:30 <br />
                    Длительность мероприятия 60 минут + по желанию свободная
                    игра до 12:30
                </p>

                <p>
                    ВНИМАНИЕ:
                    <br />
                    Запись на развивалочку происходит ТОЛЬКО в группе ватсап.
                    Просто прийти НЕЛЬЗЯ. <br />
                    Посетить мероприятие можно пробно 1 раз – 1500 руб или после
                    оплаты абонемента. На 8 или 4 посещения. (1350 руб стоимость
                    1 посещения в абонементе).
                </p>

                <p>В группе только 8 мест!</p>

                <p>
                    Оплата НЕ возвращается независимо от обстоятельств:
                    передумали, заболели, плохая погода, нет настроения - для
                    меня нет разницы почему вы не воспользовались оплаченным
                    визитом, который был подготовлен в полном объеме.
                </p>
                <p>
                    Возраст детей может быть не одинаковый, в рамках
                    развивалочки - это позитивно отражается на малышах (как ни
                    крути они берут пример с окружающих и особенно смотрят что и
                    как делают РОДИТЕЛИ)
                </p>
                <p>
                    Развивалочка - это всегда совместная работа Родителя и
                    Ребенка. Сопровождающий взрослый выполняет роль
                    ПЕРСОНАЛЬНОГО тренера для ребенка, а я веду и направляю Вас.
                    При возникновении вопросов не стесняйтесь их задавать в ЛС
                    или прямо в группе.
                </p>

                <p>
                    Раннее развитие детей — это важный этап, который закладывает
                    фундамент для их будущего физического, эмоционального,
                    интеллектуального и социального роста.
                </p>
                <p>
                    Вот ключевые принципы, которых придерживаюсь я и предлагаю
                    пользоваться этим и другим родителям:
                </p>

                <SliderRazvivalochka />

                <hr className="h-1 bg-brown" />
                <h2 className="text-2xl font-bold">
                    1. Эмоциональное развитие
                </h2>
                <p>
                    <strong>Безопасная привязанность:</strong> Уделяйте внимание
                    эмоциональной связи с ребенком. Реагируйте на его
                    потребности, проявляйте любовь и заботу. Это формирует
                    чувство безопасности и доверия к миру.
                    <br />
                    <strong>Эмоциональный интеллект:</strong> Учите ребенка
                    распознавать и выражать свои эмоции. Обсуждайте, что он
                    чувствует, и помогайте ему справляться с негативными
                    эмоциями. А я буду создавать максимально благоприятную среду
                    для получения необходимого ребенку опыта.
                </p>
                <hr className="h-1 bg-brown" />
                <h2 className="text-2xl font-bold">2. Физическое развитие</h2>
                <p>
                    <strong>Двигательная активность:</strong> Поощряйте активные
                    игры, ползание, ходьбу, бег, прыжки. Это развивает
                    координацию, силу и выносливость.
                    <br />
                    <strong>Мелкая моторика:</strong> Развивайте мелкую моторику
                    через игры с мелкими предметами (кубики, пазлы, лепка,
                    рисование). Это важно для подготовки к письму и развитию
                    речи.
                    <br />
                    <strong>Здоровый сон и питание:</strong> Следите за режимом
                    сна и обеспечивайте сбалансированное питание, богатое
                    витаминами и минералами.
                    <br />
                    Комплексность подхода гарантирует максимальный результат.
                </p>
                <hr className="h-1 bg-brown" />
                <h2 className="text-2xl font-bold">
                    3. Интеллектуальное развитие
                </h2>
                <p>
                    <strong>Развитие речи:</strong> Читайте книги,
                    разговаривайте с ребенком, задавайте вопросы, обсуждайте
                    картинки. Это стимулирует развитие речи и словарного запаса.
                    <br />
                    <strong>Логика и мышление:</strong> Играйте в игры, которые
                    развивают логику, память и внимание (например, сортировка
                    предметов, головоломки, простые настольные игры).
                    <br />
                    <strong>Творчество:</strong> Поощряйте рисование, лепку,
                    музыку, танцы. Это развивает воображение и креативность. И
                    позволяет выражать чувства и эмоции альтернативными
                    способами.
                </p>
                <hr className="h-1 bg-brown" />

                <h2 className="text-2xl font-bold">4. Социальное развитие</h2>
                <p>
                    <strong>Общение со сверстниками:</strong> Организуйте игры с
                    окружающими, чтобы ребенок учился взаимодействовать,
                    делиться и решать конфликты.
                    <br />
                    <strong>Навыки общения:</strong> Учите ребенка здороваться,
                    благодарить, просить и извиняться. Это формирует основы
                    социального поведения.
                    <br />
                    <strong>Самостоятельность:</strong> Постепенно приучайте
                    ребенка к самостоятельности (например, одеваться, убирать
                    игрушки, есть).
                    <br />
                    Главное чтобы этот процесс был естественным и в позитивном
                    ключе.
                </p>
                <hr className="h-1 bg-brown" />

                <h2 className="text-2xl font-bold">5. Сенсорное развитие</h2>
                <p>
                    <strong>Исследование мира:</strong> Давайте ребенку
                    возможность изучать окружающий мир через тактильные,
                    зрительные, слуховые и обонятельные ощущения (например, игры
                    с песком, водой, красками, музыкальными инструментами).
                    <br />
                    Важно создать возможность получения максимально
                    разнообразных впечатлений.
                </p>
                <hr className="h-1 bg-brown" />

                <h2 className="text-2xl font-bold">
                    6. Игра как основной инструмент развития
                </h2>
                <p>
                    Игра — это естественный способ познания мира для ребенка.
                    Через игру он учится, развивает навыки и выражает свои
                    эмоции.
                    <br />
                    Используйте развивающие игрушки, но не забывайте, что
                    простые предметы (коробки, ложки, ткани) тоже могут быть
                    отличными инструментами для игры.
                </p>
                <hr className="h-1 bg-brown" />

                <h2 className="text-2xl font-bold">7. Поддержка и поощрение</h2>
                <p>
                    Хвалите ребенка за усилия, а не только за результат. Это
                    формирует уверенность в себе и мотивацию к обучению.
                    <br />
                    Не сравнивайте ребенка с другими. Каждый ребенок развивается
                    в своем темпе.
                </p>
                <hr className="h-1 bg-brown" />

                <h2 className="text-2xl font-bold">8. Режим и стабильность</h2>
                <p>
                    Установите четкий режим дня (сон, питание, игры, прогулки).
                    Это дает ребенку чувство предсказуемости и безопасности.
                    <br />
                    Создайте ритуалы (например, чтение перед сном), которые
                    помогают ребенку чувствовать себя комфортно.
                </p>
                <hr className="h-1 bg-brown" />

                <h2 className="text-2xl font-bold">
                    9. Ограничение экранного времени
                </h2>
                <p>
                    Минимизируйте время, проведенное перед телевизором,
                    планшетом или телефоном. Вместо этого предлагайте активные и
                    творческие игры.
                    <br />
                    Если используете гаджеты, выбирайте качественный
                    образовательный контент.
                </p>
                <hr className="h-1 bg-brown" />

                <h2 className="text-2xl font-bold">
                    10. Индивидуальный подход
                </h2>
                <p>
                    Учитывайте интересы и особенности вашего ребенка. Не
                    старайтесь следовать строгим стандартам или сравнивать его с
                    другими детьми.
                    <br />
                    Наблюдайте за тем, что нравится ребенку, и поддерживайте его
                    увлечения.
                </p>

                <p>
                    Раннее развитие — это не только обучение, но и создание
                    условий для гармоничного роста ребенка. Главное — это
                    любовь, поддержка и внимание со стороны родителей. Не
                    стремитесь к &quot;идеальному&quot; развитию, а
                    наслаждайтесь процессом и радуйтесь маленьким успехам вашего
                    ребенка! 😊
                </p>
            </section>
            <br />
            <br />
            <br />
        </main>
    );
}
