import { Metadata } from 'next';
import Image from 'next/image';
import BreadCrumbs from '@/components/breadcrums';
import HowToConnect from '@/components/how-to-connect';
import { getStudioImages } from '../data/gallery';
import ChooseHall from '@/components/ChooseHall';

export const metadata: Metadata = {
    title: 'Студия Характер',
    description: 'Отличное место для проведения детских праздников',
};

export default async function DavaiPoigraemPage() {
    const images = await getStudioImages();

    return (
        <main className="md:container md:mx-auto pt-[85px]">
            <BreadCrumbs pageTitle="Характер" />

            <section className="py-5 lg:py-[30px] px-2.5 text-green">
                <h2 className="subtitle2 mb-4">
                    Резерв студии &quot;Характер&quot;
                </h2>

                <p>
                    Проведение мероприятия в моей студии Характер стоит 7000
                    руб/час
                </p>
                <p>в стоимость включено использование:</p>
                <p>
                    ✅ музыкального и светового оборудования
                    <br />
                    ✅ посуда, услуги организации приема пищи, уборка
                    <br />
                    ✅ игрушки и мягкие кресла мешки
                    <br />
                    ✅ трех этажный домик и горка
                    <br />
                    ✅ гигантская дженга
                    <br />
                    ✅ гамак
                    <br />
                    ✅ проектор (караоке, Джаст дэнс, ваши видео и фото)
                    <br />
                    ✅ зона с диванами и кофейным столиком
                    <br />
                    ✅ камин с огнём на био-топливе (без запаха и дыма)
                    <br />
                    ✅ Ковровое покрытие по всей поверхности пола зала
                    <br />
                    ✅ мягкий теплый пол в игровой зоне
                    <br />
                    ✅ Гарантированная дезинфекция всех поверхностей, сан узла,
                    воздуха перед КАЖДЫМ Визитом гостей
                    <br />
                    ✅ Работа сопровождающего, который встретит, будет с вами на
                    протяжении всего мероприятия, поможет в решении ЛЮБОГО
                    ВОПРОСА, рассчитает и проводит <br />
                </p>
                <br />
                <p>
                    Вместимость зала Характер - 30 посадочных мест. За каждого
                    следующего гостя оплата - 500 руб. <br />
                    Вы можете зарезервировать любое количество времени, в рамках
                    отведенных промежутков. При необходимости час делится по 15
                    минут.
                    <br />
                    С 13 до 15 часов использовать музыку запрещено 🚫
                    законодательством РФ (тихий час). <br />✅ А так же оба зала
                    доступны к резерву одновременно
                </p>
                <br />

                <h2 className="subtitle2 mb-4">
                    Для резерва зала доступны три интервала времени:
                    <br />
                    <br />
                    Утро с 9 до 13:30
                    <br />
                    Обед с 14:00 до 17:00
                    <br />
                    Вечер с 17:30 до 21:30
                </h2>
                <p className="text-sm text-center mb-5">
                    В перерывах производится уборка в зале
                </p>
                <ChooseHall hallId={2} />
            </section>

            <section className="lg:p-0">
                <h2 className="subtitle2 mb-4">
                    Фото студии &quot;Характер&quot;
                </h2>
                <div className="gallery-images">
                    {images.map((i, index) => (
                        <div key={i.id}>
                            <Image
                                key={i.filename}
                                width={406}
                                height={350}
                                src={`/${i.filename}`}
                                alt={`Интерьер студии вкуса Характер в Находке - банкетный зал для детских праздников, фото ${index + 1}`}
                                className="rounded-2xl"
                                loading="lazy"
                            />
                        </div>
                    ))}
                </div>
            </section>

            <HowToConnect />
        </main>
    );
}
