import BreadCrumbs from '@/components/breadcrums';

export default function OfferPage() {
    return (
        <main className="md:container md:mx-auto pt-[85px]">
            <BreadCrumbs pageTitle="Оферта" />
            <section className="py-5 px-3 lg:py-[30px] bg-grey-light m-0">
                <h2 className="subtitle2">ДОГОВОР ПУБЛИЧНОЙ ОФЕРТЫ</h2>
                <h2 className="subtitle text-center">
                    на оказание услуг по организации мероприятий
                </h2>
                <br />

                <p>г. Находка</p>
                <p>1 февраля 2025 г.</p>

                <br />
                <p>
                    Настоящий Договор является официальным предложением
                    (публичной офертой) Индивидуального предпринимателя Авдейчик
                    Оксаны Николаевны ИНН: 250908420896 ОГРНИП: 316253600085368
                    (далее — «Исполнитель») заключить Договор на оказание услуг
                    по организации мероприятий на условиях, изложенных ниже.
                </p>
                <br />
                <ul>
                    <li>
                        <strong>1. ТЕРМИНЫ И ОПРЕДЕЛЕНИЯ</strong>
                    </li>
                    <li>
                        1.1. <strong>Оферта</strong> — настоящий документ,
                        размещенный на сайте Исполнителя по адресу: Ленинская
                        20.
                    </li>
                    <li>
                        1.2. <strong>Акцепт</strong> Оферты — полное и
                        безоговорочное принятие условий Оферты путем оплаты
                        услуг Исполнителя.
                    </li>
                    <li>
                        1.3. <strong>Заказчик</strong> — физическое или
                        юридическое лицо, осуществившее Акцепт Оферты.
                    </li>
                    <li>
                        1.4. <strong>Услуги</strong> — услуги по организации
                        мероприятий, перечень которых указан на сайте
                        Исполнителя.
                    </li>
                    <li>
                        1.5. <strong>Мероприятие</strong> — событие,
                        организуемое Исполнителем по запросу Заказчика.
                    </li>
                </ul>
                <br />
                <ul>
                    <li>
                        <strong>2. ПРЕДМЕТ ДОГОВОРА</strong>
                    </li>
                    <li>
                        2.1. Исполнитель обязуется оказать услуги по организации
                        мероприятий в соответствии с заявкой Заказчика, а
                        Заказчик обязуется оплатить эти услуги на условиях
                        настоящего Договора.
                    </li>
                    <li>
                        2.2. Перечень услуг, их стоимость и сроки оказания
                        указываются на сайте Исполнителя и/или в индивидуальной
                        заявке Заказчика.
                    </li>
                </ul>
                <br />
                <ul>
                    <li>
                        <strong>3. ПОРЯДОК ЗАКЛЮЧЕНИЯ ДОГОВОРА</strong>
                    </li>
                    <li>
                        3.1. Договор считается заключенным с момента Акцепта
                        Оферты Заказчиком.
                    </li>
                    <li>
                        3.2. Акцепт Оферты осуществляется путем оплаты услуг
                        Исполнителя через сайт или иным способом, указанным
                        Исполнителем.
                    </li>
                    <li>
                        3.3. Заказчик соглашается с условиями Оферты путем
                        проставления соответствующей отметки при оформлении
                        заказа на сайте.
                    </li>
                </ul>
                <br />
                <ul>
                    <li>
                        <strong>4. ПРАВА И ОБЯЗАННОСТИ СТОРОН</strong>
                    </li>
                    <li>4.1. Исполнитель обязуется:</li>
                    <li>
                        <ul className="ml-5">
                            <li>
                                4.1.1. Оказать услуги в соответствии с условиями
                                настоящего Договора и заявкой Заказчика.
                            </li>
                            <li>
                                4.1.2. Предоставить Заказчику информацию о ходе
                                выполнения заказа.
                            </li>
                            <li>
                                4.1.3. Соблюдать конфиденциальность информации,
                                полученной от Заказчика.
                            </li>
                        </ul>
                    </li>
                    <li>4.2. Заказчик обязуется:</li>
                    <li>
                        <ul className="ml-5">
                            <li>
                                4.2.1. Своевременно оплатить услуги Исполнителя.
                            </li>
                            <li>
                                4.2.2. Предоставить Исполнителю всю необходимую
                                информацию для выполнения заказа.
                            </li>
                            <li>
                                4.2.3. Соблюдать условия настоящего Договора.
                            </li>
                        </ul>
                    </li>
                </ul>
                <br />

                <ul>
                    <li>
                        <strong>5. СТОИМОСТЬ УСЛУГ И ПОРЯДОК ОПЛАТЫ</strong>
                    </li>
                    <li>
                        5.1. Стоимость услуг указана в индивидуальной заявке.
                    </li>
                    <li>
                        5.2. Оплата производится в порядке 100% предоплаты или в
                        ином порядке, согласованном Сторонами.
                    </li>
                    <li>
                        5.3. Оплата осуществляется через платежные системы,
                        указанные на сайте Исполнителя.
                    </li>
                </ul>
                <br />
                <ul>
                    <li>
                        <strong>6. ОТВЕТСТВЕННОСТЬ СТОРОН</strong>
                    </li>
                    <li>
                        6.1. За неисполнение или ненадлежащее исполнение
                        обязательств по Договору Стороны несут ответственность в
                        соответствии с действующим законодательством РФ.
                    </li>
                    <li>
                        6.2. Исполнитель не несет ответственности за задержки
                        или неисполнение обязательств, вызванные
                        обстоятельствами непреодолимой силы (форс-мажор).
                    </li>
                </ul>
                <br />
                <ul>
                    <li>
                        <strong>7. ПРОЧИЕ УСЛОВИЯ</strong>
                    </li>
                    <li>
                        7.1. Все споры и разногласия разрешаются путем
                        переговоров. В случае недостижения соглашения спор
                        передается в суд по месту нахождения Исполнителя.
                    </li>
                    <li>
                        7.2. Исполнитель вправе вносить изменения в условия
                        Оферты. Изменения вступают в силу с момента их
                        опубликования на сайте.
                    </li>
                    <li>
                        7.3. Договор составлен в соответствии с
                        законодательством Российской Федерации.
                    </li>
                </ul>
                <br />
                <p>
                    <strong> 8. РЕКВИЗИТЫ ИСПОЛНИТЕЛЯ </strong>
                </p>
                <strong>
                    Индивидуальный предприниматель Авдейчик Оксана Николаевна
                </strong>

                <p>ИП Авдейчик Оксана Николаевна</p>
                <p>Телефон: 8(4236)603888</p>
                <p>Фактический адрес: Ленинская 20</p>
                <p>Сайт: https://igra-em.ru</p>
                <p>ИНН: 250908420896</p>
                <p>ОГРНИП: 316253600085368</p>
                <p>Р/с:40802810350000030240</p>
                <p>БИК: 040813608</p>
                <p>ДАЛЬНЕВОСТОЧНЫЙ БАНК ПАО СБЕРБАНК</p>
                <p>к/с: 30101810600000000608</p>
                <br />
            </section>
        </main>
    );
}
