import BreadCrumbs from '@/components/breadcrums';
import Image from 'next/image';
import Link from 'next/link';
import type { Metadata } from 'next';
import { EventSchema } from '@/components/StructuredData';

export const metadata: Metadata = {
    title: 'Новый год 2026 в Находке - новогодняя ночевка для детей, Дед Мороз',
    description: 'Новогодний праздник для детей в Находке ⭐ Ночевка в клубе Давай поиграем. Дед Мороз, подарки, программа, ужин и завтрак. 18 часов за 12000 руб ☎ +7(914)709-38-88',
    alternates: {
        canonical: 'https://igra-em.ru/new-year',
    },
    openGraph: {
        title: 'Новый год 2026 в Находке - новогодняя ночевка для детей',
        description: 'Новогодняя ночевка в клубе ⭐ Дед Мороз, подарки, программа, ужин. 18 часов за 12000 руб',
        url: 'https://igra-em.ru/new-year',
        images: ['/new-year/ny-header.jpg'],
    },
};

export default function NewYear() {
    return (
        <main className="md:container md:mx-auto pt-[85px]">
            <EventSchema
                name="Новогодняя ночевка 2026 в Давай поиграем - 19 декабря"
                description="Новый год в Давай поиграем 2026 соблюдает все лучшие традиции моих ночевок + подарки, фотограф и визит Деда Мороза! Ночь перед Новым годом это те самые приятные моменты, которые остаются в памяти навсегда."
                startDate="2025-12-19T18:00:00+10:00"
                endDate="2025-12-20T12:00:00+10:00"
                location={{
                    name: "Детский клуб Давай поиграем",
                    address: "ул. Ленинская, д. 20"
                }}
                image="https://igra-em.ru/new-year/ny-header.jpg"
                price={12000}
            />
            <EventSchema
                name="Новогодняя ночевка 2026 в Давай поиграем - 20 декабря"
                description="Новый год в Давай поиграем 2026 соблюдает все лучшие традиции моих ночевок + подарки, фотограф и визит Деда Мороза! Ночь перед Новым годом это те самые приятные моменты, которые остаются в памяти навсегда."
                startDate="2025-12-20T18:00:00+10:00"
                endDate="2025-12-21T12:00:00+10:00"
                location={{
                    name: "Детский клуб Давай поиграем",
                    address: "ул. Ленинская, д. 20"
                }}
                image="https://igra-em.ru/new-year/ny-header.jpg"
                price={12000}
            />
            <EventSchema
                name="Новогодняя ночевка 2026 в Давай поиграем - 26 декабря"
                description="Новый год в Давай поиграем 2026 соблюдает все лучшие традиции моих ночевок + подарки, фотограф и визит Деда Мороза! Ночь перед Новым годом это те самые приятные моменты, которые остаются в памяти навсегда."
                startDate="2025-12-26T18:00:00+10:00"
                endDate="2025-12-27T12:00:00+10:00"
                location={{
                    name: "Детский клуб Давай поиграем",
                    address: "ул. Ленинская, д. 20"
                }}
                image="https://igra-em.ru/new-year/ny-header.jpg"
                price={12000}
            />
            <BreadCrumbs pageTitle="Новый год 🎄" />
            <h2 className="subtitle2">НОВЫЙ ГОД в Давай поиграем</h2>
            <section
                id="main"
                className="flex flex-col gap-10 mt-5 lg:mt-[60px] px-8 max-w-[1400px] mx-auto"
            >
                <div className="flex flex-col-reverse items-center md:flex-row md:mx-auto md:gap-12 mb-10">
                    <div className="text-center text-2xl max-w-[400px]">
                        Новый год в Давай поиграем 2026 соблюдает все лучшие
                        традиции моих ночевок + подарки, фотограф и визит Деда
                        Мороза!
                    </div>
                    <Image
                        className="rounded-xl"
                        width="300"
                        height="533"
                        src="/new-year/ny-header.jpg"
                        alt="Новогодняя ночевка в детском клубе Давай поиграем в Находке - ночь перед Новым годом 2026"
                        sizes="(max-width: 768px) 90vw, 300px"
                        loading="lazy"
                    />
                </div>

                <div className="flex flex-col items-center md:flex-row md:mx-auto md:gap-12">
                    <Image
                        className="rounded-xl"
                        width="400"
                        height="500"
                        src="/new-year/refs.jpeg"
                        alt="Оформление новогоднего праздника в клубе Давай поиграем - референсы декора"
                        sizes="(max-width: 768px) 90vw, 400px"
                        loading="lazy"
                    />
                    <div className="text-center max-w-[700px]">
                        <p className="mb-10 text-2xl">
                            Ночь перед Новым годом это те самые приятные
                            моменты, которые остаются в памяти навсегда...
                        </p>

                        <p className="mb-10 text-2xl">
                            Ведь праздник в душе наступает не в полночь 31
                            декабря, а как только мы берём в руки елочное
                            украшение, ощущаем запах мандаринов, лепим пельмешки
                            всей семьей и пишем список желаний, которые загадаем
                            на будущий год!!
                        </p>

                        <p className="mb-10 text-2xl">
                            Ожидание праздника, подготовка к кульминации в
                            полночь - это и есть то самое, что каждый из вас
                            помнит из детства.
                        </p>

                        <p className="mb-10 text-2xl">
                            Сказочный вечер, ночь наполненная волшебством и утро
                            с подарками от деда Мороза - вот, что ожидает моих
                            маленьких гостей.
                        </p>
                        <ul className="text-left text-xl">
                            <li>письма желаний</li>
                            <li>имбирное рисование</li>
                            <li>огонек души</li>
                            <li>праздничный ужин</li>
                            <li>встреча с Дедом Морозом</li>
                            <li>новогодний бал</li>
                            <li>памятные снимки</li>
                            <li>стилизация и украшения</li>
                            <li>новогодний подарок</li>
                        </ul>
                    </div>
                </div>
                <p className="text-2xl">
                    Это добавляется ко всем стандартным преимуществам ночевки,
                    кто бывал, тот знает!
                </p>
                <p className="text-2xl">Это не массовое мероприятие! </p>
                <p className="text-2xl">
                    Только 10 деток, чтобы уделить максимум внимания КАЖДОМУ!
                </p>
                <p className="text-2xl">
                    Стоимость 12 000 руб - 18 часовое мероприятие, где ВСЕ
                    ВКЛЮЧЕНО
                </p>
                <p className="text-2xl">
                    <span className="text-4xl md:text-5xl">Даты</span> 19, 20,
                    26 с <span className="text-4xl md:text-5xl">18:00</span>{' '}
                    одного дня до{' '}
                    <span className="text-4xl md:text-5xl">12:00</span>{' '}
                    следующего дня
                </p>
                <p className="text-2xl">
                    <span className="text-4xl md:text-5xl">Возраст</span> с
                    момента, когда ребенок готов засыпать без маминых объятий
                </p>

                <h2 className="text-2xl">Тайминг:</h2>
                <ul>
                    <li className="text-xl mb-3">18:00 - сбор гостей</li>
                    <li className="text-xl mb-3">
                        18:30 – приготовление маршмеллоу с кондитером
                    </li>
                    <li className="text-xl mb-3">
                        19:00 - создание письма деду морозу / карты желаний на
                        2026 (по возрасту)
                    </li>
                    <li className="text-xl mb-3">
                        19:30 - подготовка к ужину, лепка пельменей
                    </li>
                    <li className="text-xl mb-3">
                        20:00 - пока варятся пельмешки и накрывается стол мы
                        колдуем с мыльными пузырями
                    </li>
                    <li className="text-xl mb-3">20:30 - ужин</li>
                    <li className="text-xl mb-3">
                        21:00 - варим КАКАО И посиделки у огня / камина,
                        новогодние истории и песни, пробуем наши маршмеллоу с
                        какао и на палочки в камин
                    </li>
                    <li className="text-xl mb-3">
                        22:00 - тянем жребий, кто где спит и «укладываемся»
                    </li>
                    <li className="text-xl mb-3">
                        22:30 - приход Деда Мороза! - программа чудес на 1 час
                        или 1,5 (по возрасту и самочувствию)
                    </li>
                    <li className="text-xl mb-3">
                        23:30 (00:00) - уходит Дед Мороз, а мы уже реально
                        ложимся спать ☺️
                    </li>
                    <li className="text-xl mb-3">
                        8:00 - подъем и распаковка подарков из-под елки 🎄 от
                        Дедушки Мороза
                    </li>
                    <li className="text-xl mb-3">8:30 - завтрак</li>
                    <li className="text-xl mb-3">9:30 - имбирное рисование</li>
                    <li className="text-xl mb-3">
                        10:30 - дети готовят и уплетают любимые лакомства -
                        сладкая вата и попкорн
                    </li>
                    <li className="text-xl mb-3">
                        11:30 - сборы вещей, новогодние переводилки, микро
                        подарочки, прям на выходе, чтобы сгладить грустинку от
                        расставания
                    </li>
                    <li className="text-xl mb-3">
                        12:00 – всех деток разбирают родители
                    </li>
                </ul>

                <div className="flex flex-col md:flex-row gap-2">
                    <Image
                        className="rounded-xl"
                        width="600"
                        height={400}
                        src="/new-year/ny-0.jpg"
                        alt="Дед Мороз на новогоднем празднике в клубе Давай поиграем в Находке"
                        sizes="(max-width: 768px) 100vw, (max-width: 1024px) 50vw, 600px"
                        loading="lazy"
                    />
                    <Image
                        className="rounded-xl"
                        width="600"
                        height={400}
                        src="/new-year/ny-2.jpg"
                        alt="Новогодняя программа с Миньонами для детей в Находке"
                        sizes="(max-width: 768px) 100vw, (max-width: 1024px) 50vw, 600px"
                        loading="lazy"
                    />
                </div>
                <div className="flex flex-col items-center md:flex-row gap-2">
                    <Image
                        className="rounded-xl"
                        width="400"
                        height={533}
                        src="/new-year/ny-1.jpeg"
                        alt="Новогодняя фотозона с гномами на детском празднике в Находке"
                        sizes="(max-width: 768px) 100vw, (max-width: 1024px) 50vw, 33vw"
                        loading="lazy"
                    />
                    <Image
                        className="rounded-xl"
                        width="400"
                        height={680}
                        src="/new-year/ny-3.jpeg"
                        alt="Приготовление маршмеллоу на новогоднем празднике для детей в Находке"
                        sizes="(max-width: 768px) 100vw, (max-width: 1024px) 50vw, 33vw"
                        loading="lazy"
                    />
                    <Image
                        className="rounded-xl"
                        width="400"
                        height={670}
                        src="/new-year/ny-4.jpeg"
                        alt="Вигвам для детской новогодней ночевки в клубе Давай поиграем"
                        sizes="(max-width: 768px) 100vw, (max-width: 1024px) 50vw, 33vw"
                        loading="lazy"
                    />
                </div>
                <Image
                    className="mx-auto rounded-xl"
                    width="600"
                    height={358}
                    src="/new-year/ny-5.jpeg"
                    alt="Празднование Нового 2026 года в детском клубе Давай поиграем в Находке"
                    sizes="(max-width: 768px) 100vw, 600px"
                    loading="lazy"
                />

                <Link className="text-center" href="/video">
                    <span className="text-2xl underline underline-offset-4">
                        Посмотрите как проходили наши утренники в прошлом году
                    </span>
                </Link>
            </section>
        </main>
    );
}
