export default function PolicyPage() {
    return (
        <main className="md:container md:mx-auto pt-[85px]">
            <section className="py-5 px-3 lg:py-[30px] bg-grey-light m-0">
                <h2 className="subtitle2">Политика конфиденциальности</h2>
                <br />

                <p>
                    Настоящая Политика конфиденциальности (далее — «Политика»)
                    регулирует порядок обработки персональных данных
                    пользователей сайта igra-em.ru, принадлежащего ИП Авдейчик
                    Оксана Николаевна (далее — «Оператор»).
                </p>

                <br />

                <ul>
                    <li>
                        <strong>1. Общие положения</strong>
                    </li>
                    <li>
                        1.1. Оператор обязуется соблюдать конфиденциальность
                        персональных данных пользователей в соответствии с
                        требованиями Федерального закона № 152-ФЗ «О
                        персональных данных».
                    </li>
                    <li>
                        1.2. Настоящая Политика применяется ко всем персональным
                        данным, которые Оператор получает от пользователей
                        Сайта.
                    </li>
                </ul>
                <br />
                <ul>
                    <li>
                        <strong>2. Какие данные мы собираем</strong>
                    </li>
                    <li>
                        2.1. Оператор собирает следующие персональные данные:{' '}
                        <br />- Номер телефона.
                    </li>
                </ul>
                <br />
                <ul>
                    <li>
                        <strong>3. Цели сбора и обработки данных</strong>
                    </li>
                    <li>
                        3.1. Персональные данные собираются и обрабатываются для
                        следующих целей: <br />
                        - Заключение и исполнение договора с заказчиком. <br />
                        - Связь с заказчиком для уточнения деталей заказа или
                        оказания услуг <br />
                        - Связь с заказчиком для информирования о выгодных и
                        новых предложениях услуг <br />
                    </li>
                </ul>
                <br />
                <ul>
                    <li>
                        <strong>4. Правовые основания обработки данных </strong>
                    </li>
                    <li>
                        4.1. Обработка персональных данных осуществляется на
                        основании согласия пользователя, предоставляемого в
                        момент отправки номера телефона через формы на Сайте.
                    </li>
                </ul>
                <br />

                <ul>
                    <li>
                        <strong>5. Способы обработки данных</strong>
                    </li>
                    <li>
                        5.1. Обработка персональных данных включает сбор,
                        запись, систематизацию, хранение, уточнение,
                        использование, удаление и уничтожение.
                    </li>
                    <li>
                        5.2. Обработка данных осуществляется с использованием
                        автоматизированных систем и без использования таковых.
                    </li>
                </ul>
                <br />
                <ul>
                    <li>
                        <strong>6. Сроки хранения данных</strong>
                    </li>
                    <li>
                        6.1. Персональные данные хранятся в течение срока,
                        необходимого для достижения целей обработки, или до
                        момента отзыва согласия пользователем.
                    </li>
                    <li>
                        6.2. После достижения целей обработки или отзыва
                        согласия персональные данные подлежат уничтожению или
                        обезличиванию.
                    </li>
                </ul>
                <br />
                <ul>
                    <li>
                        <strong>7. Передача данных третьим лицам</strong>
                    </li>
                    <li>
                        7.1. Оператор не передает персональные данные третьим
                        лицам, за исключением случаев, предусмотренных
                        законодательством Российской Федерации.
                    </li>
                </ul>
                <br />
                <ul>
                    <li>
                        <strong>8. Права пользователей</strong>
                    </li>
                    <li>
                        8.1. Пользователь имеет право: <br />
                        - Получить информацию о том, какие персональные данные о
                        нем обрабатываются. <br />
                        - Требовать уточнения, блокирования или удаления данных,
                        если они устарели, являются неполными или неточными.
                        <br />- Отозвать согласие на обработку персональных
                        данных.
                    </li>
                    <li>
                        8.2. Для реализации своих прав пользователь может
                        направить запрос на электронную почту Оператора:
                        davaypoigraemnhk@mail.ru
                    </li>
                </ul>
                <br />
                <ul>
                    <li>
                        <strong>9. Меры защиты данных</strong>
                    </li>
                    <li>
                        9.1. Оператор принимает необходимые технические и
                        организационные меры для защиты персональных данных от
                        несанкционированного доступа, утечки, изменения или
                        уничтожения.
                    </li>
                </ul>
                <br />
                <ul>
                    <li>
                        <strong>10. Контакты</strong>
                    </li>
                    <li>
                        10.1. По вопросам, связанным с обработкой персональных
                        данных, вы можете обратиться к Оператору: <br />
                        - Электронная почта: davaypoigraemnhk@mail.ru <br />-
                        Телефон: +79147093888
                    </li>
                </ul>
                <br />
                <ul>
                    <li>
                        <strong>11. Заключительные положения</strong>
                    </li>
                    <li>
                        11.1. Настоящая Политика вступает в силу с момента ее
                        опубликования на Сайте.
                    </li>
                    <li>
                        11.2. Оператор оставляет за собой право вносить
                        изменения в Политику. Новая редакция Политики вступает в
                        силу с момента ее размещения на Сайте.
                    </li>
                </ul>
                <br />
            </section>
        </main>
    );
}
